In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame(np.arange(10).reshape(5,2), index=['a','b','c','d','e'], columns=['C1','C2'])
df.loc[['b','e'], 'C1']=None
df.loc[['b','c'], 'C2']=None

In [3]:
df.sum()
df['C1'].sum()
df['C1'].cumsum()

a     0.0
b     NaN
c     4.0
d    10.0
e     NaN
Name: C1, dtype: float64

In [4]:
print(df)
print(df.mean())
print(df.mean(1))
print(df.std())

    C1   C2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0
C1    3.333333
C2    5.666667
dtype: float64
a    0.5
b    NaN
c    4.0
d    6.5
e    9.0
dtype: float64
C1    3.055050
C2    4.163332
dtype: float64

In [5]:
df['C3']=df['C1']+df['C2']
df

    C1   C2    C3
a  0.0  1.0   1.0
b  NaN  NaN   NaN
c  4.0  NaN   NaN
d  6.0  7.0  13.0
e  NaN  9.0   NaN

In [6]:
df2=pd.DataFrame({'C1':[1,1,1,1,1], 'C4':[1,1,1,1,1]}, index=['a','b','c','d','e'])
print(df)
print(df2)
print(df+df2)

    C1   C2    C3
a  0.0  1.0   1.0
b  NaN  NaN   NaN
c  4.0  NaN   NaN
d  6.0  7.0  13.0
e  NaN  9.0   NaN
   C1  C4
a   1   1
b   1   1
c   1   1
d   1   1
e   1   1
    C1  C2  C3  C4
a  1.0 NaN NaN NaN
b  NaN NaN NaN NaN
c  5.0 NaN NaN NaN
d  7.0 NaN NaN NaN
e  NaN NaN NaN NaN

In [7]:
df=pd.DataFrame(np.random.randn(5,3),columns=['c1','c2','c3'])

In [8]:
df.loc[1, ['c1','c3']]=None
df

         c1        c2        c3
0 -1.715006  1.105270 -0.003656
1       NaN  1.246492       NaN
2  0.710267  0.417353 -1.613823
3  0.168373 -1.144717  0.283944
4  0.093161 -0.861820  0.848609

In [9]:
df.loc[2,'c2']=np.nan
df.loc[3,'c2']=np.nan
df.loc[4,'c3']=np.nan
df

         c1        c2        c3
0 -1.715006  1.105270 -0.003656
1       NaN  1.246492       NaN
2  0.710267       NaN -1.613823
3  0.168373       NaN  0.283944
4  0.093161 -0.861820       NaN

In [10]:
dfMissing=df.fillna('missing')
dfMissing

          c1       c2          c3
0   -1.71501  1.10527 -0.00365558
1    missing  1.24649     missing
2   0.710267  missing    -1.61382
3   0.168373  missing    0.283944
4  0.0931606 -0.86182     missing

In [11]:
df.fillna(method='ffill')
df

         c1        c2        c3
0 -1.715006  1.105270 -0.003656
1       NaN  1.246492       NaN
2  0.710267       NaN -1.613823
3  0.168373       NaN  0.283944
4  0.093161 -0.861820       NaN

In [12]:
df.mean()

c1   -0.185801
c2    0.496647
c3   -0.444512
dtype: float64

In [13]:
df.fillna(df.mean())

         c1        c2        c3
0 -1.715006  1.105270 -0.003656
1 -0.185801  1.246492 -0.444512
2  0.710267  0.496647 -1.613823
3  0.168373  0.496647  0.283944
4  0.093161 -0.861820 -0.444512

In [14]:
pd.DataFrame(np.where(df.isnull(), df.mean(), df))

          0         1         2
0 -1.715006  1.105270 -0.003656
1 -0.185801  1.246492 -0.444512
2  0.710267  0.496647 -1.613823
3  0.168373  0.496647  0.283944
4  0.093161 -0.861820 -0.444512

In [15]:
df.where(pd.notnull(df), df.mean(), axis='columns', inplace=True)

In [16]:
df

         c1        c2        c3
0 -1.715006  1.105270 -0.003656
1 -0.185801  1.246492 -0.444512
2  0.710267  0.496647 -1.613823
3  0.168373  0.496647  0.283944
4  0.093161 -0.861820 -0.444512

In [17]:
print(df.mean())
print(df.mean()['c2'])

c1   -0.185801
c2    0.496647
c3   -0.444512
dtype: float64
0.49664749157814325

In [19]:
df.fillna(df.mean()['c1'])
df.fillna(df.mean()['c1':'c3'])

         c1        c2        c3
0 -1.715006  1.105270 -0.003656
1 -0.185801  1.246492 -0.444512
2  0.710267  0.496647 -1.613823
3  0.168373  0.496647  0.283944
4  0.093161 -0.861820 -0.444512

In [20]:
df2=pd.DataFrame({'c1':[1,2,3,4,5], 'c2':[6,7,8,9,10]})

In [21]:
df2.loc[[1,3],['c2']]=np.nan
df2

   c1    c2
0   1   6.0
1   2   NaN
2   3   8.0
3   4   NaN
4   5  10.0

In [22]:
df2['c2new']=np.where(pd.notnull(df2['c2']), df2['c2'], df2['c1'])
df2

   c1    c2  c2new
0   1   6.0    6.0
1   2   NaN    2.0
2   3   8.0    8.0
3   4   NaN    4.0
4   5  10.0   10.0

In [23]:
for i in df2.index:
    if pd.notnull(df2.loc[i,'c2'])==True:
        df.loc[i,'c2new2']=df2.loc[i,'c2']
    else:
        df.loc[i,'c2new2']=df2.loc[i,'c1']
print(df2)

   c1    c2  c2new
0   1   6.0    6.0
1   2   NaN    2.0
2   3   8.0    8.0
3   4   NaN    4.0
4   5  10.0   10.0

In [24]:
df=pd.DataFrame(np.random.randn(5, 4), columns=['c1','c2','c3','c4'])
df.loc[[0,1],'c1']=None
df.loc[2,'c2']=None
df

         c1        c2        c3        c4
0       NaN -0.764372  1.455276  1.040509
1       NaN -2.123239  1.900018  0.362127
2 -1.232996       NaN -0.689457 -0.013030
3 -0.172286  1.381767  1.195258 -0.353918
4 -0.813396  0.162347  0.962547  0.581899

In [25]:
print(df.dropna(axis=0))
print(df.dropna(axis=1))

         c1        c2        c3        c4
3 -0.172286  1.381767  1.195258 -0.353918
4 -0.813396  0.162347  0.962547  0.581899
         c3        c4
0  1.455276  1.040509
1  1.900018  0.362127
2 -0.689457 -0.013030
3  1.195258 -0.353918
4  0.962547  0.581899

In [26]:
print(df)
print(df['c1'])
print(df['c1'].dropna())

         c1        c2        c3        c4
0       NaN -0.764372  1.455276  1.040509
1       NaN -2.123239  1.900018  0.362127
2 -1.232996       NaN -0.689457 -0.013030
3 -0.172286  1.381767  1.195258 -0.353918
4 -0.813396  0.162347  0.962547  0.581899
0         NaN
1         NaN
2   -1.232996
3   -0.172286
4   -0.813396
Name: c1, dtype: float64
2   -1.232996
3   -0.172286
4   -0.813396
Name: c1, dtype: float64

In [27]:
print(df[['c1','c2','c3']].dropna())
print(df[['c1','c2','c3']].dropna(axis=1))
print(df.loc[[2,4],['c1','c2','c3']].dropna())

         c1        c2        c3
3 -0.172286  1.381767  1.195258
4 -0.813396  0.162347  0.962547
         c3
0  1.455276
1  1.900018
2 -0.689457
3  1.195258
4  0.962547
         c1        c2        c3
4 -0.813396  0.162347  0.962547

In [28]:
from datetime import datetime

In [29]:
datestr=["09/09/2020","09/11/2020", "09/12/2020","09/18/2020"]
dates=pd.to_datetime(datestr)

In [30]:
ts=pd.Series([1,np.nan, np.nan, 10], index=dates)
ts

2020-09-09     1.0
2020-09-11     NaN
2020-09-12     NaN
2020-09-18    10.0
dtype: float64

In [31]:
tsLinear=ts.interpolate()
tsLinear

2020-09-09     1.0
2020-09-11     4.0
2020-09-12     7.0
2020-09-18    10.0
dtype: float64

In [32]:
ts.interpolate(method='values')

2020-09-09     1.0
2020-09-11     3.0
2020-09-12     4.0
2020-09-18    10.0
dtype: float64

In [33]:
ts.interpolate(method='time')

2020-09-09     1.0
2020-09-11     3.0
2020-09-12     4.0
2020-09-18    10.0
dtype: float64

In [34]:
ser=pd.Series([1,2,3,4,np.nan])
ser

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [35]:
ser.replace(2,10)
ser.replace(np.nan, 5)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [36]:
print(ser.replace([1,2,3,4,np.nan], [10,11,12,13,15]))
print(ser.replace({1:10, 2:7, 3:12, 4:13, np.nan:15}))

0    10.0
1    11.0
2    12.0
3    13.0
4    15.0
dtype: float64
0    10.0
1     7.0
2    12.0
3    13.0
4    15.0
dtype: float64

In [37]:
df=pd.DataFrame({'c1':['a_old','b','c','d','e'], 'c2':[1,2,3,4,5],'c3':[6,7,8,9,np.nan]})
df
df.replace({'c1':'a_old'}, {'c1':'a_new'})
df.replace({'c3':np.nan}, {'c3':10})

      c1  c2    c3
0  a_old   1   6.0
1      b   2   7.0
2      c   3   8.0
3      d   4   9.0
4      e   5  10.0

In [38]:
df={'key1':['a','b','b','c','c'],
   'key2':['v','w','w','x','y'],
   'col':[1,2,3,4,5]}
df

df=pd.DataFrame(df)
df

  key1 key2  col
0    a    v    1
1    b    w    2
2    b    w    3
3    c    x    4
4    c    y    5

In [40]:
print(df.duplicated('key1'))
print(df.duplicated(['key1']))

0    False
1    False
2     True
3    False
4     True
dtype: bool
0    False
1    False
2     True
3    False
4     True
dtype: bool

In [41]:
df[df.duplicated(['key1','key2'])]

  key1 key2  col
2    b    w    3

In [42]:
df.duplicated(['key1'])  #keep='first'
df.duplicated(['key1'], keep='first')

df.duplicated(['key1'], keep='last')

df.duplicated(['key1'], keep=False)

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [43]:
df.drop_duplicates(['key1'], keep='first')

  key1 key2  col
0    a    v    1
1    b    w    2
3    c    x    4

In [44]:
df.drop_duplicates(['key1'], keep='last')

  key1 key2  col
0    a    v    1
2    b    w    3
4    c    y    5

In [45]:
df.drop_duplicates(['key1'], keep=False)

  key1 key2  col
0    a    v    1

In [46]:
df=pd.DataFrame({'a':['a1','a1','a2','a2','a3','a3'], 'b':['b1','b1','b1','b1','b2',np.nan], 'c':[1,1,3,4,4,4]})
df

    a    b  c
0  a1   b1  1
1  a1   b1  1
2  a2   b1  3
3  a2   b1  4
4  a3   b2  4
5  a3  NaN  4

In [47]:
df['a'].unique()

array(['a1', 'a2', 'a3'], dtype=object)

In [48]:
df['b'].unique()

array(['b1', 'b2', nan], dtype=object)

In [49]:
df['a'].value_counts()

a2    2
a3    2
a1    2
Name: a, dtype: int64

In [51]:
df['b'].value_counts()
df['b'].value_counts(dropna=True)
df['b'].value_counts(dropna=False)

b1     4
b2     1
NaN    1
Name: b, dtype: int64

In [52]:
df['c'].value_counts(normalize=True)

4    0.500000
1    0.333333
3    0.166667
Name: c, dtype: float64

In [53]:
df['c'].value_counts()
df['c'].value_counts(ascending=True)
df['c'].value_counts(sort=False)

1    2
3    1
4    3
Name: c, dtype: int64

In [54]:
df['b'].value_counts() #nan 제외, 디폴트
df['b'].value_counts(dropna=False)

b1     4
b2     1
NaN    1
Name: b, dtype: int64

In [55]:
df['c'].value_counts(bins=[1,2,3,4,5], sort=False)

(0.999, 2.0]    2
(2.0, 3.0]      1
(3.0, 4.0]      3
(4.0, 5.0]      0
Name: c, dtype: int64

In [56]:
df['c']

0    1
1    1
2    3
3    4
4    4
5    4
Name: c, dtype: int64

In [57]:
out=pd.cut(df['c'], bins=[1,2,3,4,5])
out

0           NaN
1           NaN
2    (2.0, 3.0]
3    (3.0, 4.0]
4    (3.0, 4.0]
5    (3.0, 4.0]
Name: c, dtype: category
Categories (4, interval[int64]): [(1, 2] < (2, 3] < (3, 4] < (4, 5]]

In [58]:
pd.value_counts(out)

(3, 4]    3
(2, 3]    1
(4, 5]    0
(1, 2]    0
Name: c, dtype: int64